Repository: balthild/CalendarShouter
Catalog: Sources/CalendarShouterCore/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# aboutCopyright
source: Copyright © 2026 Balthild. Released under the GNU Affero General Public License v3.0 (AGPL-3.0).
zh_hans: 版权所有 © 2026 Balthild。本项目基于 GNU Affero General Public License 3.0 (AGPL-3.0) 许可协议发布。

# aboutMadeBy
source: Made by %@
zh_hans: 由 %@ 制作

# aboutVersion
source: Version %@ (%@)
zh_hans: 版本：%@（%@）

source: All day
zh_hans: 全天

# calendarAccessDenied
source: Calendar access was denied. Enable it in System Settings.
zh_hans: 日历访问已被拒绝，请在系统设置中开启。

# calendarAccessRequired
source: Calendar access is required to show reminders.
zh_hans: 显示提醒需要访问日历。

# canvasAccountColumn
source: Account
zh_hans: 账户

# canvasAccountsHeader
source: Accounts
zh_hans: 账户

# canvasAddAccount
source: Add Account…
zh_hans: 添加账户…

# canvasAddAccountPrompt
source: Enter your school's Canvas address.
zh_hans: 请输入你所在学校的 Canvas 地址。

# canvasAddReminderRule
source: Add Reminder Time…
zh_hans: 添加提醒时间…

# canvasAuthorizeInstruction
source: Sign in to your Canvas account to allow access.
zh_hans: 请登录你的 Canvas 账户以授权访问。

# canvasCancel
source: Cancel
zh_hans: 取消

# canvasContinue
source: Continue
zh_hans: 继续

# canvasDomainColumn
source: Site
zh_hans: 站点

# canvasDurationDays
source: %lld d
zh_hans: %lld 天

# canvasDurationHours
source: %lld hr
zh_hans: %lld 小时

# canvasDurationMinutes
source: %lld min
zh_hans: %lld 分钟

# canvasEnableCourses
source: Courses
zh_hans: 课程

# canvasErrorDomain
source: That address is not a Canvas site with mobile access enabled.
zh_hans: 该地址不是启用了移动访问的 Canvas 站点。

# canvasErrorGeneric
source: Something went wrong. Please try again.
zh_hans: 出现问题，请重试。

# canvasErrorServer
source: Canvas refused the request. Please try again later.
zh_hans: Canvas 拒绝了该请求，请稍后重试。

# canvasErrorSignInFailed
source: Sign-in failed. Please try again.
zh_hans: 登录失败，请重试。

# canvasErrorUnsupportedClient
source: Canvas did not recognise this app.
zh_hans: Canvas 未能识别此应用。

# canvasLoadingCourses
source: Loading courses…
zh_hans: 正在载入课程…

# canvasNeedsSignIn
source: Sign in again to keep this account up to date
zh_hans: 请重新登录以保持该账户同步

# canvasNoCourses
source: No courses found.
zh_hans: 未找到课程。

# canvasOnlyEnabledCourses
source: Reminders are only shown for the enabled courses.
zh_hans: 仅对启用的课程显示提醒。

# canvasReminderRuleColumn
source: Reminder
zh_hans: 提醒

# canvasReminderRuleEditorTitle
source: Reminder Time
zh_hans: 提醒时间

# canvasReminderTimesCaption
source: Canvas assignments carry no alarms of their own, so reminder times are set relative to the due date.
zh_hans: Canvas 作业本身没有提醒设置，因此需要相对于截止时间自行设置提醒时间。

# canvasReminderTimesHeader
source: Reminder Times
zh_hans: 提醒时间

# canvasRemoveAccount
source: Remove this account
zh_hans: 移除该账户

# canvasRemoveReminderRule
source: Remove this reminder time
zh_hans: 移除该提醒时间

# canvasRuleDaysFormat
source: %lld days before the due date, at %@
zh_hans: 截止日期前 %lld 天，%@

# canvasRuleDaysTemplate
source: {} days before the due date, at {}
zh_hans: 截止日期前 {} 天，{}

# canvasRuleDaysTitle
source: Some days before the due date
zh_hans: 截止前若干天

# canvasRuleOffsetFormat
source: %@ before the deadline
zh_hans: 截止时间前 %@

# canvasRuleOffsetTemplate
source: {} before the deadline
zh_hans: 截止时间前 {}

# canvasRuleOffsetTitle
source: A set time before the deadline
zh_hans: 提前固定时长

# canvasRuleOnDueDayFormat
source: On the due date at %@
zh_hans: 截止当天，%@

# canvasRuleOnDueDayTemplate
source: On the due date at {}
zh_hans: 截止当天，{}

# canvasRuleOnDueDayTitle
source: On the due date
zh_hans: 截止当天

# canvasSave
source: Save
zh_hans: 保存

# canvasSignInAgain
source: Sign In Again
zh_hans: 重新登录

# demoCalendarTitle
source: Demo calendar
zh_hans: 演示日历

# demoEventLocation
source: Conference Room
zh_hans: 会议室

# demoEventNotes
source: This is a demonstration reminder, shown on demand.
zh_hans: 这是一条按需显示的演示提醒。

# demoEventTitle
source: Demo event
zh_hans: 演示事件

source: Enable Calendars
zh_hans: 启用日历

# fifteenMinutes
source: 15 minutes
zh_hans: 15 分钟

# fiveMinutes
source: 5 minutes
zh_hans: 5 分钟

source: Grant Access…
zh_hans: 授予访问权限…

source: Ignore
zh_hans: 忽略

source: Ignore All
zh_hans: 全部忽略

# includeReminders
source: Enable alerts from the “Reminders” app.
zh_hans: 启用来自“提醒事项”应用的提醒

source: Launch at login
zh_hans: 登录时启动

source: Location
zh_hans: 地点

# loginItemApprovalMessage
source: CalendarShouter is set to launch at login, but macOS needs you to approve it in System Settings first.
zh_hans: 日历提醒已设为登录时启动，但需要你先在系统设置中批准。

# loginItemApprovalTitle
source: Approve Login Item
zh_hans: 需要批准登录项

# loginItemAutomationMessage
source: CalendarShouter needs permission to control System Events before it can add itself to your login items. Grant it in System Settings → Privacy & Security → Automation.
zh_hans: 日历提醒需要获得控制“系统事件”的权限，才能把自己加入登录项。请在“系统设置 → 隐私与安全性 → 自动化”中允许。

# loginItemAutomationTitle
source: Automation Permission Needed
zh_hans: 需要“自动化”权限

# menuClose
source: Close
zh_hans: 关闭

# menuCopy
source: Copy
zh_hans: 拷贝

# menuCut
source: Cut
zh_hans: 剪切

# menuEdit
source: Edit
zh_hans: 编辑

# menuFile
source: File
zh_hans: 文件

# menuPaste
source: Paste
zh_hans: 粘贴

# menuQuit
source: Quit CalendarShouter
zh_hans: 退出日历提醒

# menuRedo
source: Redo
zh_hans: 重做

# menuSelectAll
source: Select All
zh_hans: 全选

# menuSettings
source: Settings…
zh_hans: 设置…

# menuUndo
source: Undo
zh_hans: 撤销

source: Missed reminders
zh_hans: 错过的提醒

# noCalendars
source: No calendars available
zh_hans: 没有可用的日历

source: No Items
zh_hans: 无项目

source: No sound
zh_hans: 无声音

source: Not Now
zh_hans: 以后再说

source: Notes
zh_hans: 备注

source: Open Login Items Settings
zh_hans: 打开登录项设置

source: Open System Settings
zh_hans: 打开系统设置

source: Reminder sound
zh_hans: 提醒声音

# remindersAccessDeniedMessage
source: CalendarShouter needs access to your reminders before it can shout for them. Grant it in System Settings → Privacy & Security → Reminders.
zh_hans: “日历提醒”需要访问“提醒事项”才能为其发出提醒。请在“系统设置 → 隐私与安全性 → 提醒事项”中允许。

# remindersAccessDeniedTitle
source: Reminders Access Needed
zh_hans: 需要“提醒事项”权限

# remindersOnlyForEnabledCalendars
source: Reminders are only shown for the enabled calendars.
zh_hans: 仅对启用的日历显示提醒。

# settingsWindowTitle
source: Settings
zh_hans: 设置

source: Show menu bar icon
zh_hans: 显示菜单栏图标

source: Show missed reminders
zh_hans: 显示错过的提醒

source: Snooze
zh_hans: 稍后提醒

source: Snooze All
zh_hans: 全部稍后提醒

# tabAbout
source: About
zh_hans: 关于

# tabCalendars
source: Calendars
zh_hans: 日历

# tabGeneral
source: General
zh_hans: 通用

# tenMinutes
source: 10 minutes
zh_hans: 10 分钟

# thirtyMinutes
source: 30 minutes
zh_hans: 30 分钟

source: Untitled event
zh_hans: 无标题事件
